---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings
source: html/b31a53eb-f416-9b44-0b96-5ebf3f50c755.htm
---
# AnalysisDisplayColoredSurfaceSettings Methods

Compares two colored surface settings objects.